tests/test_richards/case/system/blockMeshDict
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      blockMeshDict;
}

scale 1e-3;

vertices
(
    (0 0 0)
    (30 0 0)
    (30 10 0)
    (0 10 0)
    (0 0 0.18)
    (30 0 0.18)
    (30 10 0.18)
    (0 10 0.18)
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (5000 1 1) simpleGrading (1 1 1)
);

edges
(
);

patches
(
    patch left
    (
        (0 3 7 4)
    )

    patch right
    (
        (1 5 6 2)
    )

    empty top
    (
        (4 7 6 5)
    )

    empty bottom
    (
        (0 1 2 3)
    )

    empty front
    (
        (0 4 5 1)
    )

    empty back
    (
        (2 6 7 3)
    )
);

mergePatchPairs
(
);
